_Rarzrabotki/BASEBuh/Catalogs/ОбщиеНазванияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ОбщиеНазванияНоменклатуры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Единица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаРекомендуемая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДляОбъединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверятьВЗакупкахпоСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КоэффициентыПересчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/BASEBuh/CommonModules/А_СтруктураСебестоимостиСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////
// Структура себестоимости (СС): оригинал Excel по модулям, коэффициенты пересчёта единиц,
// файлы-основания.
//
// Три слоя СС:
//  КомплектующиеПоМодульно — оригинал файла (единицы и количества как в Excel), кодом не правится;
//  КоэффициентыПересчета   — коэффициент на позицию оригинала, единицы которой не совпадают
//                            с единицей общего названия; по умолчанию — из правил
//                            ОбщиеНазванияНоменклатуры.КоэффициентыПересчета, можно задать вручную;
//  Комплектующие           — количества в единицах закупки. Сумма строки не меняется НИКОГДА.
//
// Правило общего названия: ЕдиницаСС × Коэффициент = ОбщиеНазванияНоменклатуры.Единица.
// Пустая НоменклатураСС в правиле — правило на всё название, заполненная — на конкретную позицию.
///////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Ключи

// Убирает концевые пробелы и схлопывает серии пробелов в один.
Функция НормализоватьНаименование(Знач Текст) Экспорт
	Текст = СокрЛП("" + Текст);
	Пока СтрНайти(Текст, "  ") > 0 Цикл
		Текст = СтрЗаменить(Текст, "  ", " ");
	КонецЦикла;
	Возврат Текст;
КонецФункции

// Ключ сравнения наименований: нормализованное в нижнем регистре.
Функция КлючНаименования(Знач Текст) Экспорт
	Возврат НРег(НормализоватьНаименование(Текст));
КонецФункции

// Ключ сравнения единиц: нормализованное в нижнем регистре, написания прорабов сведены к канону
// («м.п.» = «п.м» = «пог.м», «м.кв.» = «м2», «шт.» = «шт» …).
Функция КлючЕдиницы(Знач Текст) Экспорт
	Ключ = КлючНаименования(Текст);
	Синоним = СинонимЕдиницы(Ключ);
	Возврат ?(Синоним = Неопределено, Ключ, НРег(Синоним));
КонецФункции

// Написания прорабов, которых нет в классификаторе, — к каноническому наименованию единицы.
//
// Параметры:
//  Ключ - Строка - единица в нижнем регистре после нормализации.
//
// Возвращаемое значение:
//  Строка, Неопределено - каноническое наименование или Неопределено, если синонима нет.
//
Функция СинонимЕдиницы(Знач Ключ) Экспорт

	Таблица = Новый Соответствие;
	Таблица.Вставить("м.кв", "м2");
	Таблица.Вставить("м.кв.", "м2");
	Таблица.Вставить("м/кв", "м2");
	Таблица.Вставить("мкв", "м2");
	Таблица.Вставить("кв.м", "м2");
	Таблица.Вставить("кв.м.", "м2");
	Таблица.Вставить("кв м", "м2");
	Таблица.Вставить("м²", "м2");
	Таблица.Вставить("м.п", "пог.м");
	Таблица.Вставить("м.п.", "пог.м");
	Таблица.Вставить("м/п", "пог.м");
	Таблица.Вставить("мп", "пог.м");
	Таблица.Вставить("п.м", "пог.м");
	Таблица.Вставить("п.м.", "пог.м");
	Таблица.Вставить("пм", "пог.м");
	Таблица.Вставить("пог.м.", "пог.м");
	Таблица.Вставить("пог м", "пог.м");
	Таблица.Вставить("м.куб", "м3");
	Таблица.Вставить("м.куб.", "м3");
	Таблица.Вставить("м/куб", "м3");
	Таблица.Вставить("куб.м", "м3");
	Таблица.Вставить("куб м", "м3");
	Таблица.Вставить("м куб", "м3");
	Таблица.Вставить("м³", "м3");
	Таблица.Вставить("шт.", "шт");
	Таблица.Вставить("штук", "шт");

	Возврат Таблица.Получить(Ключ);

КонецФункции

// Ключ позиции для сопоставления строк Комплектующие с оригиналом: Этап + НоменклатураСС.
// Общее название в ключ НЕ входит: бухгалтер переназначает его в Комплектующие (на живых СС IRC так
// переназначено 54 из 168 и 68 из 170 позиций), а НоменклатураСС — текст позиции из файла — не меняется.
// Единица тоже не входит: после пересчёта ЕдиницаСС строки Комплектующие — уже единица закупки.
Функция КлючПозиции(Этап, НоменклатураСС) Экспорт
	Возврат КлючСсылки(Этап) + "|" + КлючНаименования(НоменклатураСС);
КонецФункции

// Ключ строки коэффициента: позиция + единица оригинала.
Функция КлючСтрокиКоэффициента(Этап, НоменклатураСС, ЕдиницаСС) Экспорт
	Возврат КлючПозиции(Этап, НоменклатураСС) + "|" + КлючЕдиницы(ЕдиницаСС);
КонецФункции

// Ключ признака «Додано вручну»: только НоменклатураСС. Этап не входит —
// ручной перенос строки в другой этап не делает её «ручной».
Функция КлючОригинала(НоменклатураСС) Экспорт
	Возврат КлючНаименования(НоменклатураСС);
КонецФункции

#КонецОбласти

#Область Коэффициенты

// Правила пересчёта и единицы общих названий — одним пакетом запросов.
//
// Параметры:
//  ОбщиеНазвания - Массив из СправочникСсылка.ОбщиеНазванияНоменклатуры
//
// Возвращаемое значение:
//  Соответствие - ключ: СправочникСсылка.ОбщиеНазванияНоменклатуры, значение: Структура:
//   * Точные     - Соответствие - "КлючЕдиницы|КлючНаименования" -> Число
//   * Общие      - Соответствие - "КлючЕдиницы" -> Число
//   * Единица    - СправочникСсылка.КлассификаторЕдиницИзмерения
//   * ЕдиницаКлюч - Строка - КлючЕдиницы(наименование единицы карточки)
//   * ОсновнаяНоменклатура - СправочникСсылка.Номенклатура
//
Функция ПравилаКоэффициентов(ОбщиеНазвания) Экспорт

	Правила = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КоэффициентыПересчета.Ссылка КАК ОбщееНазвание,
	|	КоэффициентыПересчета.ЕдиницаСС КАК ЕдиницаСС,
	|	КоэффициентыПересчета.НоменклатураСС КАК НоменклатураСС,
	|	КоэффициентыПересчета.Коэффициент КАК Коэффициент
	|ИЗ
	|	Справочник.ОбщиеНазванияНоменклатуры.КоэффициентыПересчета КАК КоэффициентыПересчета
	|ГДЕ
	|	КоэффициентыПересчета.Ссылка В(&ОбщиеНазвания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеНазвания.Ссылка КАК ОбщееНазвание,
	|	ОбщиеНазвания.Единица КАК Единица,
	|	ЕСТЬNULL(ОбщиеНазвания.Единица.Наименование, """") КАК ЕдиницаНаименование,
	|	ОбщиеНазвания.ОсновнаяНоменклатура КАК ОсновнаяНоменклатура
	|ИЗ
	|	Справочник.ОбщиеНазванияНоменклатуры КАК ОбщиеНазвания
	|ГДЕ
	|	ОбщиеНазвания.Ссылка В(&ОбщиеНазвания)";
	Запрос.УстановитьПараметр("ОбщиеНазвания", ОбщиеНазвания);
	Результаты = Запрос.ВыполнитьПакет();

	Выборка = Результаты[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("Точные", Новый Соответствие);
		Данные.Вставить("Общие", Новый Соответствие);
		Данные.Вставить("Единица", Выборка.Единица);
		Данные.Вставить("ЕдиницаКлюч", КлючЕдиницы(Выборка.ЕдиницаНаименование));
		Данные.Вставить("ОсновнаяНоменклатура", Выборка.ОсновнаяНоменклатура);
		Правила.Вставить(Выборка.ОбщееНазвание, Данные);
	КонецЦикла;

	Выборка = Результаты[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Данные = Правила.Получить(Выборка.ОбщееНазвание);
		Если Данные = Неопределено Или Выборка.Коэффициент <= 0 Тогда
			Продолжить;
		КонецЕсли;
		КлючЕд = КлючЕдиницы(Выборка.ЕдиницаСС);
		Если ПустаяСтрока(СокрЛП(Выборка.НоменклатураСС)) Тогда
			Данные.Общие.Вставить(КлючЕд, Выборка.Коэффициент);
		Иначе
			Данные.Точные.Вставить(КлючЕд + "|" + КлючНаименования(Выборка.НоменклатураСС), Выборка.Коэффициент);
		КонецЕсли;
	КонецЦикла;

	Возврат Правила;

КонецФункции

// Коэффициент по правилам: точное правило -> общее правило -> единицы совпадают (1) -> не найден (0).
//
// Возвращаемое значение:
//  Структура - Коэффициент (Число), Источник (ПеречислениеСсылка.А_ИсточникиКоэффициентаПересчетаСС).
//
Функция НайтиКоэффициент(Правила, ОбщееНазвание, ЕдиницаСС, НоменклатураСС) Экспорт

	Источники = Перечисления.А_ИсточникиКоэффициентаПересчетаСС;
	Результат = Новый Структура("Коэффициент, Источник", 0, Источники.НеНайден);

	Данные = Правила.Получить(ОбщееНазвание);
	Если Данные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	КлючЕд = КлючЕдиницы(ЕдиницаСС);
	Коэффициент = Данные.Точные.Получить(КлючЕд + "|" + КлючНаименования(НоменклатураСС));
	Если Коэффициент <> Неопределено Тогда
		Результат.Коэффициент = Коэффициент;
		Результат.Источник = Источники.ПравилоТочное;
		Возврат Результат;
	КонецЕсли;

	Коэффициент = Данные.Общие.Получить(КлючЕд);
	Если Коэффициент <> Неопределено Тогда
		Результат.Коэффициент = Коэффициент;
		Результат.Источник = Источники.ПравилоОбщее;
		Возврат Результат;
	КонецЕсли;

	Если Не ПустаяСтрока(КлючЕд) И КлючЕд = Данные.ЕдиницаКлюч Тогда
		Результат.Коэффициент = 1;
		Результат.Источник = Источники.ЕдиницыСовпадают;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Строит/дополняет ТЧ КоэффициентыПересчета по оригиналу (КомплектующиеПоМодульно всех модулей).
// В ТЧ попадают только позиции, единица которых не совпадает с единицей общего названия.
// Коэффициенты с источником «Вручную» и «Подобран по факту» не перезаписываются.
// Объект не записывается.
//
// Параметры:
//  Объект - СправочникОбъект.СтруктураСебестоимости, ДанныеФормыСтруктура
//
// Возвращаемое значение:
//  Структура - протокол: Добавлено, Обновлено, Удалено, СохраненоРучных, НеНайдено, Детали (Массив строк).
//
Функция ЗаполнитьКоэффициенты(Объект) Экспорт

	Протокол = Новый Структура("Добавлено, Обновлено, Удалено, СохраненоРучных, НеНайдено, Детали",
		0, 0, 0, 0, 0, Новый Массив);

	Свертка = СверткаОригинала(Объект);
	Правила = ПравилаКоэффициентов(ОбщиеНазванияОбъекта(Объект));
	Источники = Перечисления.А_ИсточникиКоэффициентаПересчетаСС;

	Существующие = Новый Соответствие;
	Для Каждого СтрокаКоэф Из Объект.КоэффициентыПересчета Цикл
		Существующие.Вставить(КлючСтрокиКоэффициента(СтрокаКоэф.Этап,
			СтрокаКоэф.НоменклатураСС, СтрокаКоэф.ЕдиницаСС), СтрокаКоэф);
	КонецЦикла;

	Нужные = Новый Соответствие;
	Для Каждого Позиция Из Свертка Цикл

		ДанныеНазвания = Правила.Получить(Позиция.ОбщееНазвание);
		ЕдиницаКлюч = ?(ДанныеНазвания = Неопределено, "", ДанныеНазвания.ЕдиницаКлюч);
		Если Не ПустаяСтрока(ЕдиницаКлюч) И КлючЕдиницы(Позиция.ЕдиницаСС) = ЕдиницаКлюч Тогда
			Продолжить; // единицы совпадают — пересчёт не нужен
		КонецЕсли;
		Нужные.Вставить(Позиция.Ключ, Истина);

		СтрокаКоэф = Существующие.Получить(Позиция.Ключ);
		Если СтрокаКоэф = Неопределено Тогда
			СтрокаКоэф = Объект.КоэффициентыПересчета.Добавить();
			СтрокаКоэф.Этап = Позиция.Этап;
			СтрокаКоэф.ОбщееНазвание = Позиция.ОбщееНазвание;
			СтрокаКоэф.НоменклатураСС = Позиция.НоменклатураСС;
			СтрокаКоэф.ЕдиницаСС = Позиция.ЕдиницаСС;
			Протокол.Добавлено = Протокол.Добавлено + 1;
		Иначе
			Протокол.Обновлено = Протокол.Обновлено + 1;
		КонецЕсли;

		СтрокаКоэф.КоличествоОригинал = Позиция.Количество;
		СтрокаКоэф.ЕдиницаЗакупки = ?(ДанныеНазвания = Неопределено,
			Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка(), ДанныеНазвания.Единица);

		Если СтрокаКоэф.ИсточникКоэффициента = Источники.Вручную
			Или СтрокаКоэф.ИсточникКоэффициента = Источники.ПодобранПоФакту Тогда
			Протокол.СохраненоРучных = Протокол.СохраненоРучных + 1;
		Иначе
			Найденный = НайтиКоэффициент(Правила, Позиция.ОбщееНазвание, Позиция.ЕдиницаСС, Позиция.НоменклатураСС);
			СтрокаКоэф.Коэффициент = Найденный.Коэффициент;
			СтрокаКоэф.ИсточникКоэффициента = Найденный.Источник;
		КонецЕсли;
		СтрокаКоэф.КоличествоПересчитанное = Окр(СтрокаКоэф.КоличествоОригинал * СтрокаКоэф.Коэффициент, 3);

		Если СтрокаКоэф.ИсточникКоэффициента = Источники.НеНайден Тогда
			Протокол.НеНайдено = Протокол.НеНайдено + 1;
			Протокол.Детали.Добавить(СтрШаблон(НСтр("ru = 'коэффициент не найден: %1 / %2, %3 %4 -> %5'; uk = 'коефіцієнт не знайдено: %1 / %2, %3 %4 -> %5'"),
				Позиция.ОбщееНазвание, Позиция.НоменклатураСС, Позиция.Количество, Позиция.ЕдиницаСС,
				СтрокаКоэф.ЕдиницаЗакупки));
		КонецЕсли;

	КонецЦикла;

	Для Индекс = -Объект.КоэффициентыПересчета.Количество() + 1 По 0 Цикл
		СтрокаКоэф = Объект.КоэффициентыПересчета[-Индекс];
		Ключ = КлючСтрокиКоэффициента(СтрокаКоэф.Этап,
			СтрокаКоэф.НоменклатураСС, СтрокаКоэф.ЕдиницаСС);
		Если Нужные.Получить(Ключ) = Неопределено Тогда
			Протокол.Детали.Добавить(СтрШаблон(НСтр("ru = 'удалена строка коэффициента (нет в оригинале): %1 / %2 %3'; uk = 'видалено рядок коефіцієнта (немає в оригіналі): %1 / %2 %3'"),
				СтрокаКоэф.ОбщееНазвание, СтрокаКоэф.НоменклатураСС, СтрокаКоэф.ЕдиницаСС));
			Объект.КоэффициентыПересчета.Удалить(-Индекс);
			Протокол.Удалено = Протокол.Удалено + 1;
		КонецЕсли;
	КонецЦикла;

	Возврат Протокол;

КонецФункции

// Пересчитывает Количество строк Комплектующие по ТЧ КоэффициентыПересчета. Объект не записывается.
//
// Строка Комплектующие сопоставляется со строкой коэффициента по ключу Этап + НоменклатураСС.
// Если у позиции несколько строк коэффициентов (одна позиция в разных модулях в разных единицах,
// например м3 и м2), строки Комплектующие разводятся по единице оригинала ЕдиницаСС_Оригинал
// (ГруппыПоЕдиницам); не разводится — позиция «неоднозначно» и не трогается.
// Строки «Добавлено вручную» не трогаются. Если строке коэффициента соответствует несколько строк
// Комплектующие, пересчитанное количество делится между ними пропорционально
// КоличествоСС_Оригинал, иначе текущему Количество, иначе Сумма, иначе поровну.
// Сумма не меняется; контроль Σ Сумма до = после, при нарушении ТЧ восстанавливается.
//
// Параметры:
//  Объект          - СправочникОбъект.СтруктураСебестоимости, ДанныеФормыСтруктура
//  НомерСтрокиКоэф - Число - 0: все позиции; иначе НомерСтроки ТЧ КоэффициентыПересчета —
//                    пересчитываются только строки Комплектующие этой строки коэффициента.
//
// Возвращаемое значение:
//  Структура - протокол: Пересчитано, НеНайдено, НетВКомплектующих, Неоднозначно, СуммаДо, СуммаПосле,
//              Ошибка, ТекстОшибки, Детали.
//
Функция ПересчитатьКоличество(Объект, НомерСтрокиКоэф = 0) Экспорт

	Протокол = Новый Структура("Пересчитано, НеНайдено, НетВКомплектующих, Неоднозначно, СуммаДо, СуммаПосле, Ошибка, ТекстОшибки, Детали",
		0, 0, 0, 0, 0, 0, Ложь, "", Новый Массив);

	Сохраненные = Объект.Комплектующие.Выгрузить();
	Протокол.СуммаДо = Сохраненные.Итог("Сумма");

	Попытка

		КоэффициентыПоПозициям = Новый Соответствие;
		Для Каждого СтрокаКоэф Из Объект.КоэффициентыПересчета Цикл
			ДобавитьВСписок(КоэффициентыПоПозициям,
				КлючПозиции(СтрокаКоэф.Этап, СтрокаКоэф.НоменклатураСС), СтрокаКоэф);
		КонецЦикла;

		СтрокиПоПозициям = СтрокиКомплектующихПоПозициям(Объект);

		Для Каждого Элемент Из КоэффициентыПоПозициям Цикл

			СтрокиКоэф = Элемент.Значение;
			Если НомерСтрокиКоэф <> 0 И НайтиСтрокуКоэффициента(СтрокиКоэф, НомерСтрокиКоэф) = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			СтрокиКомплектующих = СтрокиПоПозициям.Получить(Элемент.Ключ);
			Если СтрокиКомплектующих = Неопределено Тогда
				Протокол.НетВКомплектующих = Протокол.НетВКомплектующих + 1;
				Протокол.Детали.Добавить(СтрШаблон(НСтр("ru = 'нет строки в Комплектующих: %1 / %2'; uk = 'немає рядка в Комплектуючих: %1 / %2'"),
					СтрокиКоэф[0].ОбщееНазвание, СтрокиКоэф[0].НоменклатураСС));
				Продолжить;
			КонецЕсли;

			Группы = ГруппыПоЕдиницам(СтрокиКоэф, СтрокиКомплектующих);
			Если ТипЗнч(Группы) = Тип("Строка") Тогда
				Протокол.Неоднозначно = Протокол.Неоднозначно + 1;
				Протокол.Детали.Добавить(СтрШаблон(НСтр("ru = 'неоднозначно (разные единицы одной позиции): %1 / %2 — %3'; uk = 'неоднозначно (різні одиниці однієї позиції): %1 / %2 — %3'"),
					СтрокиКоэф[0].ОбщееНазвание, СтрокиКоэф[0].НоменклатураСС, Группы));
				Продолжить;
			КонецЕсли;

			Для Каждого Группа Из Группы Цикл

				СтрокаКоэф = Группа.СтрокаКоэф;
				Если НомерСтрокиКоэф <> 0 И СтрокаКоэф.НомерСтроки <> НомерСтрокиКоэф Тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаКоэф.Коэффициент <= 0 Тогда
					Протокол.НеНайдено = Протокол.НеНайдено + 1;
					Если НомерСтрокиКоэф <> 0 Тогда
						Протокол.Детали.Добавить(НСтр("ru = 'коэффициент не задан — строка не пересчитана'; uk = 'коефіцієнт не задано — рядок не перераховано'"));
					КонецЕсли;
					Продолжить;
				КонецЕсли;

				ПрименитьКоэффициент(СтрокаКоэф, Группа.Строки);
				Протокол.Пересчитано = Протокол.Пересчитано + Группа.Строки.Количество();

				Если НомерСтрокиКоэф <> 0 Тогда
					НомераСтрок = Новый Массив;
					Для Каждого СтрокаКомпл Из Группа.Строки Цикл
						НомераСтрок.Добавить(Формат(СтрокаКомпл.НомерСтроки, "ЧГ=0"));
					КонецЦикла;
					Протокол.Детали.Добавить(СтрШаблон(НСтр("ru = '%1, %2: %3 × %4 = %5 %6 → строки Комплектующих № %7'; uk = '%1, %2: %3 × %4 = %5 %6 → рядки Комплектуючих № %7'"),
						СтрокаКоэф.НоменклатураСС, СтрокаКоэф.ЕдиницаСС, СтрокаКоэф.КоличествоОригинал,
						СтрокаКоэф.Коэффициент, Окр(СтрокаКоэф.КоличествоОригинал * СтрокаКоэф.Коэффициент, 3),
						СтрокаКоэф.ЕдиницаЗакупки, СтрСоединить(НомераСтрок, ", ")));
				КонецЕсли;

			КонецЦикла;

		КонецЦикла;

		Протокол.СуммаПосле = Объект.Комплектующие.Итог("Сумма");
		Если Протокол.СуммаПосле <> Протокол.СуммаДо Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Σ Сумма изменилась при пересчёте: было %1, стало %2'; uk = 'Σ Сума змінилася під час перерахунку: було %1, стало %2'"),
				Протокол.СуммаДо, Протокол.СуммаПосле);
		КонецЕсли;

	Исключение
		Объект.Комплектующие.Загрузить(Сохраненные);
		Протокол.Ошибка = Истина;
		Протокол.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Протокол;

КонецФункции

// Разовый подбор коэффициентов для СС, чьи Комплектующие уже пересчитаны вручную:
// k = Σ Комплектующие.Количество / Σ оригинала по позиции, источник «Подобран по факту».
// После подбора ПересчитатьКоличество не меняет ни одного количества. Объект не записывается.
//
// Возвращаемое значение:
//  Структура - протокол ЗаполнитьКоэффициенты + Подобрано, НетВКомплектующих, Неоднозначно.
//
Функция ПодобратьКоэффициентыПоФакту(Объект) Экспорт

	Протокол = ЗаполнитьКоэффициенты(Объект);
	Протокол.Вставить("Подобрано", 0);
	Протокол.Вставить("НетВКомплектующих", 0);
	Протокол.Вставить("Неоднозначно", 0);
	Протокол.Вставить("НеПересчитаныРанее", 0);

	Источники = Перечисления.А_ИсточникиКоэффициентаПересчетаСС;
	СтрокиПоПозициям = СтрокиКомплектующихПоПозициям(Объект);

	КоэффициентыПоПозициям = Новый Соответствие;
	Для Каждого СтрокаКоэф Из Объект.КоэффициентыПересчета Цикл
		ДобавитьВСписок(КоэффициентыПоПозициям,
			КлючПозиции(СтрокаКоэф.Этап, СтрокаКоэф.НоменклатураСС), СтрокаКоэф);
	КонецЦикла;

	Для Каждого Элемент Из КоэффициентыПоПозициям Цикл
		СтрокиКомплектующих = СтрокиПоПозициям.Получить(Элемент.Ключ);
		Если СтрокиКомплектующих = Неопределено Тогда
			Протокол.НетВКомплектующих = Протокол.НетВКомплектующих + 1;
			Протокол.Детали.Добавить(СтрШаблон(НСтр("ru = 'подбор по факту невозможен (нет строки в Комплектующих): %1 / %2'; uk = 'підбір за фактом неможливий (немає рядка в Комплектуючих): %1 / %2'"),
				Элемент.Значение[0].ОбщееНазвание, Элемент.Значение[0].НоменклатураСС));
			Продолжить;
		КонецЕсли;
		Группы = ГруппыПоЕдиницам(Элемент.Значение, СтрокиКомплектующих);
		Если ТипЗнч(Группы) = Тип("Строка") Тогда
			Протокол.Неоднозначно = Протокол.Неоднозначно + 1;
			Продолжить;
		КонецЕсли;
		Для Каждого Группа Из Группы Цикл
			СтрокаКоэф = Группа.СтрокаКоэф;
			Если СтрокаКоэф.КоличествоОригинал = 0 Тогда
				Протокол.НетВКомплектующих = Протокол.НетВКомплектующих + 1;
				Протокол.Детали.Добавить(СтрШаблон(НСтр("ru = 'подбор по факту невозможен (нет строки в Комплектующих): %1 / %2'; uk = 'підбір за фактом неможливий (немає рядка в Комплектуючих): %1 / %2'"),
					СтрокаКоэф.ОбщееНазвание, СтрокаКоэф.НоменклатураСС));
				Продолжить;
			КонецЕсли;
			КоличествоФакт = 0;
			Для Каждого СтрокаКомпл Из Группа.Строки Цикл
				КоличествоФакт = КоличествоФакт + СтрокаКомпл.Количество;
			КонецЦикла;
			Если КоличествоФакт = СтрокаКоэф.КоличествоОригинал Тогда
				// Единицы разные, а количество не пересчитывалось: «по факту» тут нечего подбирать —
				// остаётся коэффициент правил (или «не найден»), позиция видна как нерешённая.
				Протокол.НеПересчитаныРанее = Протокол.НеПересчитаныРанее + 1;
				Продолжить;
			КонецЕсли;
			СтрокаКоэф.Коэффициент = Окр(КоличествоФакт / СтрокаКоэф.КоличествоОригинал, 9);
			СтрокаКоэф.ИсточникКоэффициента = Источники.ПодобранПоФакту;
			СтрокаКоэф.КоличествоПересчитанное = Окр(СтрокаКоэф.КоличествоОригинал * СтрокаКоэф.Коэффициент, 3);
			Протокол.Подобрано = Протокол.Подобрано + 1;
		КонецЦикла;
	КонецЦикла;

	Возврат Протокол;

КонецФункции

// Записывает (добавляет или заменяет) правило пересчёта в карточку общего названия.
//
// Параметры:
//  ОбщееНазвание  - СправочникСсылка.ОбщиеНазванияНоменклатуры
//  ЕдиницаСС      - Строка - единица Excel
//  НоменклатураСС - Строка - пусто: правило на всё название
//  Коэффициент    - Число
//  Комментарий    - Строка
//
// Возвращаемое значение:
//  Булево - Истина, если заменено существующее правило.
//
Функция ЗаписатьПравило(ОбщееНазвание, Знач ЕдиницаСС, Знач НоменклатураСС, Коэффициент, Комментарий = "") Экспорт

	Если Не ЗначениеЗаполнено(ОбщееНазвание) Или Коэффициент <= 0 Тогда
		ВызватьИсключение НСтр("ru = 'Для правила нужны общее название и коэффициент больше нуля.'; uk = 'Для правила потрібні загальна назва та коефіцієнт більше нуля.'");
	КонецЕсли;

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ОбщиеНазванияНоменклатуры");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ОбщееНазвание);

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		КарточкаОбъект = ОбщееНазвание.ПолучитьОбъект();
		КлючЕд = КлючЕдиницы(ЕдиницаСС);
		КлючНом = КлючНаименования(НоменклатураСС);
		Правило = Неопределено;
		Для Каждого СтрокаПравила Из КарточкаОбъект.КоэффициентыПересчета Цикл
			Если КлючЕдиницы(СтрокаПравила.ЕдиницаСС) = КлючЕд
				И КлючНаименования(СтрокаПравила.НоменклатураСС) = КлючНом Тогда
				Правило = СтрокаПравила;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Заменено = (Правило <> Неопределено);
		Если Правило = Неопределено Тогда
			Правило = КарточкаОбъект.КоэффициентыПересчета.Добавить();
			Правило.ЕдиницаСС = НормализоватьНаименование(ЕдиницаСС);
			Правило.НоменклатураСС = НормализоватьНаименование(НоменклатураСС);
		КонецЕсли;
		Правило.Коэффициент = Коэффициент;
		Если Не ПустаяСтрока(Комментарий) Тогда
			Правило.Комментарий = Комментарий;
		КонецЕсли;
		КарточкаОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат Заменено;

КонецФункции

// Проверка ТЧ правил карточки общего названия: пара (ЕдиницаСС, НоменклатураСС) уникальна,
// единица заполнена, коэффициент больше нуля. Вызывается из ОбработкаПроверкиЗаполнения.
Процедура ПроверитьПравилаОбщегоНазвания(Объект, Отказ) Экспорт

	Встречавшиеся = Новый Соответствие;
	Для Каждого СтрокаПравила Из Объект.КоэффициентыПересчета Цикл
		ПутьСтроки = СтрШаблон("Объект.КоэффициентыПересчета[%1].", Формат(СтрокаПравила.НомерСтроки - 1, "ЧН=0; ЧГ=0"));
		Если ПустаяСтрока(СокрЛП(СтрокаПравила.ЕдиницаСС)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Строка %1: не заполнена единица СС.'; uk = 'Рядок %1: не заповнено одиницю СС.'"),
				СтрокаПравила.НомерСтроки), , ПутьСтроки + "ЕдиницаСС", , Отказ);
		КонецЕсли;
		Если СтрокаПравила.Коэффициент <= 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Строка %1: коэффициент должен быть больше нуля.'; uk = 'Рядок %1: коефіцієнт має бути більшим за нуль.'"),
				СтрокаПравила.НомерСтроки), , ПутьСтроки + "Коэффициент", , Отказ);
		КонецЕсли;
		Ключ = КлючЕдиницы(СтрокаПравила.ЕдиницаСС) + "|" + КлючНаименования(СтрокаПравила.НоменклатураСС);
		Если Встречавшиеся.Получить(Ключ) <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Строка %1 повторяет правило строки %2.'; uk = 'Рядок %1 повторює правило рядка %2.'"),
				СтрокаПравила.НомерСтроки, Встречавшиеся.Получить(Ключ)), , ПутьСтроки + "НоменклатураСС", , Отказ);
		Иначе
			Встречавшиеся.Вставить(Ключ, СтрокаПравила.НомерСтроки);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОригиналИКомплектующие

// Признак «Добавлено вручную» строк Комплектующие: строка, НоменклатураСС которой
// нет в КомплектующиеПоМодульно. Если оригинала нет вовсе — признак не трогается.
Процедура ОтметитьДобавленныеВручную(Объект) Экспорт

	Если Объект.КомплектующиеПоМодульно.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ВОригинале = Новый Соответствие;
	Для Каждого СтрокаОригинала Из Объект.КомплектующиеПоМодульно Цикл
		ВОригинале.Вставить(КлючОригинала(СтрокаОригинала.НоменклатураСС), Истина);
	КонецЦикла;

	Для Каждого СтрокаКомпл Из Объект.Комплектующие Цикл
		СтрокаКомпл.ДобавленоВручную = (ВОригинале.Получить(
			КлючОригинала(СтрокаКомпл.НоменклатураСС)) = Неопределено);
	КонецЦикла;

КонецПроцедуры

// Ссылочные поля строк оригинала модуля (ОбщееНазвание, Номенклатура, Единица) берутся из строки Комплектующие
// той же позиции (Этап + НоменклатураСС, иначе только НоменклатураСС): там общее название подобрано бухгалтером,
// а движок загрузки разрешает его по сырой «узагальненій назві» файла. Позиция без пары сохраняет ссылки движка.
// НеСовпадает и ЕдиницаОбщееНазвание пересчитываются по итоговому общему названию. Объект не записывается.
//
// Параметры:
//  Объект - СправочникОбъект.СтруктураСебестоимости
//  Модуль - Число - модуль оригинала, 0 — все строки.
//
// Возвращаемое значение:
//  Структура - Сопоставлено, БезПары (Число).
//
Функция ПривестиСсылкиОригиналаККомплектующим(Объект, Модуль) Экспорт

	Результат = Новый Структура("Сопоставлено, БезПары", 0, 0);

	ПоПозиции = Новый Соответствие;
	ПоНаименованию = Новый Соответствие;
	Для Каждого СтрокаКомпл Из Объект.Комплектующие Цикл
		Если СтрокаКомпл.ДобавленоВручную Тогда
			Продолжить;
		КонецЕсли;
		Ключ = КлючПозиции(СтрокаКомпл.Этап, СтрокаКомпл.НоменклатураСС);
		Если ПоПозиции.Получить(Ключ) = Неопределено Тогда
			ПоПозиции.Вставить(Ключ, СтрокаКомпл);
		КонецЕсли;
		Ключ = КлючОригинала(СтрокаКомпл.НоменклатураСС);
		Если ПоНаименованию.Получить(Ключ) = Неопределено Тогда
			ПоНаименованию.Вставить(Ключ, СтрокаКомпл);
		КонецЕсли;
	КонецЦикла;

	СтрокиМодуля = Новый Массив;
	Для Каждого СтрокаОригинала Из Объект.КомплектующиеПоМодульно Цикл
		Если Модуль <> 0 И СтрокаОригинала.Модуль <> Модуль Тогда
			Продолжить;
		КонецЕсли;
		СтрокиМодуля.Добавить(СтрокаОригинала);
		Пара = ПоПозиции.Получить(КлючПозиции(СтрокаОригинала.Этап, СтрокаОригинала.НоменклатураСС));
		Если Пара = Неопределено Тогда
			Пара = ПоНаименованию.Получить(КлючОригинала(СтрокаОригинала.НоменклатураСС));
		КонецЕсли;
		Если Пара = Неопределено Тогда
			Результат.БезПары = Результат.БезПары + 1;
			Продолжить;
		КонецЕсли;
		СтрокаОригинала.ОбщееНазвание = Пара.ОбщееНазвание;
		СтрокаОригинала.Номенклатура = Пара.Номенклатура;
		Результат.Сопоставлено = Результат.Сопоставлено + 1;
	КонецЦикла;

	Правила = ПравилаКоэффициентов(ОбщиеНазванияОбъекта(Объект));
	Для Каждого СтрокаОригинала Из СтрокиМодуля Цикл
		ДанныеНазвания = Правила.Получить(СтрокаОригинала.ОбщееНазвание);
		Если ДанныеНазвания = Неопределено Тогда
			СтрокаОригинала.ЕдиницаОбщееНазвание = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
			СтрокаОригинала.НеСовпадает = Истина;
			Продолжить;
		КонецЕсли;
		СтрокаОригинала.Единица = ДанныеНазвания.Единица;
		СтрокаОригинала.ЕдиницаОбщееНазвание = ДанныеНазвания.Единица;
		СтрокаОригинала.НеСовпадает = (КлючЕдиницы(СтрокаОригинала.ЕдиницаСС) <> ДанныеНазвания.ЕдиницаКлюч);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Формирует Комплектующие из оригинала всех модулей: свёртка по Этап + НоменклатураСС + ЕдиницаСС, строки «Добавлено вручную» сохраняются; затем коэффициенты и пересчёт количества.
// Объект не записывается.
//
// Возвращаемое значение:
//  Структура - Строк, СохраненоВручную, Коэффициенты (протокол ЗаполнитьКоэффициенты),
//              Пересчет (протокол ПересчитатьКоличество).
//
Функция СформироватьКомплектующиеИзОригинала(Объект) Экспорт

	Протокол = Новый Структура("Строк, СохраненоВручную, Коэффициенты, Пересчет", 0, 0);

	Ручные = Новый Массив;
	Для Каждого СтрокаКомпл Из Объект.Комплектующие Цикл
		Если СтрокаКомпл.ДобавленоВручную Тогда
			Ручные.Добавить(Новый Структура("Этап, ОбщееНазвание, Номенклатура, Единица, Количество, Сумма, НоменклатураСС, ЕдиницаСС, ЕдиницаСС_Оригинал, КоличествоСС_Оригинал, Цена"));
			ЗаполнитьЗначенияСвойств(Ручные[Ручные.ВГраница()], СтрокаКомпл);
		КонецЕсли;
	КонецЦикла;

	Свертка = СверткаОригинала(Объект);
	Правила = ПравилаКоэффициентов(ОбщиеНазванияОбъекта(Объект));

	Объект.Комплектующие.Очистить();
	Для Каждого Позиция Из Свертка Цикл
		НоваяСтрока = Объект.Комплектующие.Добавить();
		НоваяСтрока.Этап = Позиция.Этап;
		НоваяСтрока.ОбщееНазвание = Позиция.ОбщееНазвание;
		ДанныеНазвания = Правила.Получить(Позиция.ОбщееНазвание);
		Если ДанныеНазвания <> Неопределено Тогда
			НоваяСтрока.Номенклатура = ДанныеНазвания.ОсновнаяНоменклатура;
			НоваяСтрока.Единица = ДанныеНазвания.Единица;
		КонецЕсли;
		НоваяСтрока.НоменклатураСС = Позиция.НоменклатураСС;
		НоваяСтрока.ЕдиницаСС = Позиция.ЕдиницаСС;
		НоваяСтрока.Количество = Позиция.Количество;
		НоваяСтрока.Сумма = Позиция.Сумма;
		НоваяСтрока.ЕдиницаСС_Оригинал = Позиция.ЕдиницаСС;
		НоваяСтрока.КоличествоСС_Оригинал = Позиция.Количество;
		НоваяСтрока.Цена = ?(Позиция.Количество = 0, 0, Окр(Позиция.Сумма / Позиция.Количество, 2));
		Протокол.Строк = Протокол.Строк + 1;
	КонецЦикла;

	Для Каждого Ручная Из Ручные Цикл
		НоваяСтрока = Объект.Комплектующие.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Ручная);
		НоваяСтрока.ДобавленоВручную = Истина;
		Протокол.СохраненоВручную = Протокол.СохраненоВручную + 1;
	КонецЦикла;

	Протокол.Коэффициенты = ЗаполнитьКоэффициенты(Объект);
	Протокол.Пересчет = ПересчитатьКоличество(Объект);

	Возврат Протокол;

КонецФункции

// Свёртка оригинала (КомплектующиеПоМодульно всех модулей) по Этап + НоменклатураСС + ЕдиницаСС
// (общее название — первой строки позиции).
//
// Возвращаемое значение:
//  Массив из Структура - Ключ, Этап, ОбщееНазвание, НоменклатураСС, ЕдиницаСС, Количество, Сумма
//                        (в порядке первого появления позиции в оригинале).
//
Функция СверткаОригинала(Объект) Экспорт

	Результат = Новый Массив;
	ПоКлючу = Новый Соответствие;
	Для Каждого СтрокаОригинала Из Объект.КомплектующиеПоМодульно Цикл
		Ключ = КлючСтрокиКоэффициента(СтрокаОригинала.Этап,
			СтрокаОригинала.НоменклатураСС, СтрокаОригинала.ЕдиницаСС);
		Позиция = ПоКлючу.Получить(Ключ);
		Если Позиция = Неопределено Тогда
			Позиция = Новый Структура("Ключ, Этап, ОбщееНазвание, НоменклатураСС, ЕдиницаСС, Количество, Сумма",
				Ключ, СтрокаОригинала.Этап, СтрокаОригинала.ОбщееНазвание,
				НормализоватьНаименование(СтрокаОригинала.НоменклатураСС),
				НормализоватьНаименование(СтрокаОригинала.ЕдиницаСС), 0, 0);
			ПоКлючу.Вставить(Ключ, Позиция);
			Результат.Добавить(Позиция);
		КонецЕсли;
		Позиция.Количество = Позиция.Количество + СтрокаОригинала.Количество;
		Позиция.Сумма = Позиция.Сумма + СтрокаОригинала.Сумма;
	КонецЦикла;
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ФайлыОснования

// Присоединяет файл-основание к записанной СС (подсистема БСП «Работа с файлами»).
//
// Параметры:
//  ВладелецФайла   - СправочникСсылка.СтруктураСебестоимости - записанная СС
//  ДвоичныеДанные  - ДвоичныеДанные - содержимое файла
//  ИмяФайла        - Строка - имя с расширением, без пути
//
// Возвращаемое значение:
//  СправочникСсылка.СтруктураСебестоимостиПрисоединенныеФайлы
//
Функция ПрисоединитьФайл(ВладелецФайла, ДвоичныеДанные, Знач ИмяФайла) Экспорт

	Если Не ЗначениеЗаполнено(ВладелецФайла) Тогда
		ВызватьИсключение НСтр("ru = 'Структура себестоимости не записана — файл присоединить нельзя.'; uk = 'Структуру собівартості не записано — файл приєднати не можна.'");
	КонецЕсли;

	Файл = Новый Файл(ИмяФайла);
	Расширение = Сред(Файл.Расширение, 2);

	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("Автор", Пользователи.АвторизованныйПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов", ВладелецФайла);
	ПараметрыФайла.Вставить("ИмяБезРасширения", Файл.ИмяБезРасширения);
	ПараметрыФайла.Вставить("РасширениеБезТочки", Расширение);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ТекущаяУниверсальнаяДата());

	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	Возврат РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, Адрес);

КонецФункции

// Заменяет строку ТЧ ФайлыОснования модуля (модуль 0 — файл на всю СС). Объект не записывается.
Процедура УстановитьФайлОснования(Объект, Модуль, Файл, КоличествоСтрок, СуммаИтого) Экспорт

	Для Индекс = -Объект.ФайлыОснования.Количество() + 1 По 0 Цикл
		Если Объект.ФайлыОснования[-Индекс].Модуль = Модуль Тогда
			Объект.ФайлыОснования.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;

	НоваяСтрока = Объект.ФайлыОснования.Добавить();
	НоваяСтрока.Модуль = Модуль;
	НоваяСтрока.Файл = Файл;
	НоваяСтрока.ДатаЗагрузки = ТекущаяДатаСеанса();
	НоваяСтрока.КоличествоСтрок = КоличествоСтрок;
	НоваяСтрока.СуммаИтого = СуммаИтого;
	Объект.ФайлыОснования.Сортировать("Модуль");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючСсылки(Ссылка)
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	Возврат Строка(Ссылка.УникальныйИдентификатор());
КонецФункции

Процедура ДобавитьВСписок(Соответствие, Ключ, Значение)
	Список = Соответствие.Получить(Ключ);
	Если Список = Неопределено Тогда
		Список = Новый Массив;
		Соответствие.Вставить(Ключ, Список);
	КонецЕсли;
	Список.Добавить(Значение);
КонецПроцедуры

Функция ОбщиеНазванияОбъекта(Объект)
	Встречавшиеся = Новый Соответствие;
	Результат = Новый Массив;
	Для Каждого ИмяТЧ Из СтрРазделить("КомплектующиеПоМодульно,Комплектующие,КоэффициентыПересчета", ",") Цикл
		Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ.ОбщееНазвание) И Встречавшиеся.Получить(СтрокаТЧ.ОбщееНазвание) = Неопределено Тогда
				Встречавшиеся.Вставить(СтрокаТЧ.ОбщееНазвание, Истина);
				Результат.Добавить(СтрокаТЧ.ОбщееНазвание);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Строки Комплектующие (кроме «Добавлено вручную») по ключу позиции.
Функция СтрокиКомплектующихПоПозициям(Объект)
	Результат = Новый Соответствие;
	Для Каждого СтрокаКомпл Из Объект.Комплектующие Цикл
		Если СтрокаКомпл.ДобавленоВручную Тогда
			Продолжить;
		КонецЕсли;
		ДобавитьВСписок(Результат,
			КлючПозиции(СтрокаКомпл.Этап, СтрокаКомпл.НоменклатураСС), СтрокаКомпл);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Строки Комплектующие позиции по строкам её коэффициентов.
// Одна строка коэффициента — ей все строки позиции. Несколько (позиция в разных модулях в разных
// единицах) — строка Комплектующие относится к коэффициенту своей единицы оригинала ЕдиницаСС_Оригинал.
//
// Возвращаемое значение:
//  Массив из Структура - СтрокаКоэф, Строки (Массив строк Комплектующие), в порядке СтрокиКоэф;
//  Строка - причина, по которой позицию развести нельзя (строка без единицы оригинала или с чужой
//           единицей, либо единице коэффициента не досталось ни одной строки — строки слиты вручную).
//
Функция ГруппыПоЕдиницам(СтрокиКоэф, СтрокиКомплектующих)

	Группы = Новый Массив;
	Если СтрокиКоэф.Количество() = 1 Тогда
		Группы.Добавить(Новый Структура("СтрокаКоэф, Строки", СтрокиКоэф[0], СтрокиКомплектующих));
		Возврат Группы;
	КонецЕсли;

	ПоЕдинице = Новый Соответствие;
	Для Каждого СтрокаКоэф Из СтрокиКоэф Цикл
		Группа = Новый Структура("СтрокаКоэф, Строки", СтрокаКоэф, Новый Массив);
		Группы.Добавить(Группа);
		ПоЕдинице.Вставить(КлючЕдиницы(СтрокаКоэф.ЕдиницаСС), Группа);
	КонецЦикла;

	Для Каждого СтрокаКомпл Из СтрокиКомплектующих Цикл
		Группа = ПоЕдинице.Получить(КлючЕдиницы(СтрокаКомпл.ЕдиницаСС_Оригинал));
		Если Группа = Неопределено Тогда
			Возврат СтрШаблон(НСтр("ru = 'строка Комплектующих № %1: единица оригинала «%2» не совпадает ни с одной строкой коэффициента'; uk = 'рядок Комплектуючих № %1: одиниця оригіналу «%2» не збігається з жодним рядком коефіцієнта'"),
				Формат(СтрокаКомпл.НомерСтроки, "ЧГ=0"), СтрокаКомпл.ЕдиницаСС_Оригинал);
		КонецЕсли;
		Группа.Строки.Добавить(СтрокаКомпл);
	КонецЦикла;

	Для Каждого Группа Из Группы Цикл
		Если Группа.Строки.Количество() = 0 Тогда
			Возврат СтрШаблон(НСтр("ru = 'для единицы «%1» нет строки в Комплектующих (строки объединены?)'; uk = 'для одиниці «%1» немає рядка в Комплектуючих (рядки об''єднано?)'"),
				Группа.СтрокаКоэф.ЕдиницаСС);
		КонецЕсли;
	КонецЦикла;

	Возврат Группы;

КонецФункции

Функция НайтиСтрокуКоэффициента(СтрокиКоэф, НомерСтроки)
	Для Каждого СтрокаКоэф Из СтрокиКоэф Цикл
		Если СтрокаКоэф.НомерСтроки = НомерСтроки Тогда
			Возврат СтрокаКоэф;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Пересчитанное количество позиции раскладывается по её строкам Комплектующие.
Процедура ПрименитьКоэффициент(СтрокаКоэф, СтрокиКомплектующих)

	Всего = Окр(СтрокаКоэф.КоличествоОригинал * СтрокаКоэф.Коэффициент, 3);
	Веса = ВесаРаспределения(СтрокиКомплектующих);
	СуммаВесов = 0;
	Для Каждого Вес Из Веса Цикл
		СуммаВесов = СуммаВесов + Вес;
	КонецЦикла;

	НаименованиеЕдиницы = СокрЛП(Строка(СтрокаКоэф.ЕдиницаЗакупки));
	Распределено = 0;
	РаспределеноОригинала = 0;
	Последняя = СтрокиКомплектующих.ВГраница();
	Для Индекс = 0 По Последняя Цикл
		СтрокаКомпл = СтрокиКомплектующих[Индекс];
		Если Индекс = Последняя Тогда
			Доля = Всего - Распределено;
			ДоляОригинала = СтрокаКоэф.КоличествоОригинал - РаспределеноОригинала;
		Иначе
			Доля = Окр(Всего * Веса[Индекс] / СуммаВесов, 3);
			ДоляОригинала = Окр(СтрокаКоэф.КоличествоОригинал * Веса[Индекс] / СуммаВесов, 3);
		КонецЕсли;
		Распределено = Распределено + Доля;
		РаспределеноОригинала = РаспределеноОригинала + ДоляОригинала;

		СтрокаКомпл.Количество = Доля;
		СтрокаКомпл.КоличествоСС_Оригинал = ДоляОригинала;
		СтрокаКомпл.ЕдиницаСС_Оригинал = СтрокаКоэф.ЕдиницаСС;
		Если ЗначениеЗаполнено(СтрокаКоэф.ЕдиницаЗакупки) Тогда
			СтрокаКомпл.Единица = СтрокаКоэф.ЕдиницаЗакупки;
			СтрокаКомпл.ЕдиницаСС = НаименованиеЕдиницы;
		КонецЕсли;
		СтрокаКомпл.Цена = ?(Доля = 0, 0, Окр(СтрокаКомпл.Сумма / Доля, 2));
	КонецЦикла;

КонецПроцедуры

// Веса распределения: КоличествоСС_Оригинал, иначе Количество, иначе Сумма, иначе поровну.
Функция ВесаРаспределения(СтрокиКомплектующих)
	Для Каждого ИмяПоля Из СтрРазделить("КоличествоСС_Оригинал,Количество,Сумма", ",") Цикл
		Веса = Новый Массив;
		Всего = 0;
		ВсеПоложительные = Истина;
		Для Каждого СтрокаКомпл Из СтрокиКомплектующих Цикл
			Веса.Добавить(СтрокаКомпл[ИмяПоля]);
			Всего = Всего + СтрокаКомпл[ИмяПоля];
			ВсеПоложительные = ВсеПоложительные И СтрокаКомпл[ИмяПоля] > 0;
		КонецЦикла;
		Если Всего > 0 И ВсеПоложительные Тогда
			Возврат Веса;
		КонецЕсли;
	КонецЦикла;
	Веса = Новый Массив;
	Для Каждого СтрокаКомпл Из СтрокиКомплектующих Цикл
		Веса.Добавить(1);
	КонецЦикла;
	Возврат Веса;
КонецФункции

#КонецОбласти
